TaurusExample/test5.yml
---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: simple
- concurrency: 100
  ramp-up: 2m
  hold-for: 3m
  scenario: get-tickets
  
scenarios:
  get-tickets:
    script: Test3.jmx
    properties:  
      log_level.jmeter: DEBUG
    variables: 
      path_to_cities_csv: cities.csv
      path_to_presons_csv: persons.csv
    modifications:
      disable: 
      - Uniform Random Timer 1
  simple:
    think-time: 0.75
    requests:
    - http://blazedemo.com/
    - http://blazedemo.com/vacation.html

modules:
  jmeter:
    gui: false
  local:
    sequential: true

reporting:
- module: passfail
  criteria:
  - avg-rt of GetMainPage>200ms for 10s, stop as failed
  - subject: rc5* 
    condition: '>'  
    threshold: 5% 
    fail: true 
    stop: true
  - class: bzt.modules.monitoring.MonitoringCriteria
    subject: local/cpu
    condition: '>'
    threshold: 90
    timeframe: 5s